# 1- Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.

# Пример:

# [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

# $$$$$$$$$$$$$$$$$$$$$$$$$$$$

# 1 

# x = [2, 3, 6, 10, 12, 16, 5]

# summ = 0
# for i in range(1, len(x), 2):
#         summ += x[i]       
# print(f"{x} -> сумма элементов на нечётных позициях: {summ}")

# $$$$$$$$$$$$$$$$$$$$$$$$$$$$

# 2-Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# [2, 3, 4, 5, 6] => [12, 15, 16];
# [2, 3, 5, 6] => [12, 15]

# $$$$$$$$$$$$$$$$$$$$$$$$$$

# 2

# def mult_lst(lst):
#     l = len(lst)//2 + 1 if len(lst) % 2 != 0 else len(lst)//2
#     new_lst = [lst[i]*lst[len(lst)-i-1] for i in range(l)]
#     print(new_lst)

# lst = [2, 3, 4, 5, 6]
# mult_lst(lst)
# lst = list(map(int, input("Введите числа через пробел:\n").split()))
# mult_lst(lst)