# 1- Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.

# Пример:

# [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

# $$$$$$$$$$$$$$$$$$$$$$$$$$$$

# 1 

# x = [2, 3, 6, 10, 12, 16, 5]

# summ = 0
# for i in range(1, len(x), 2):
#         summ += x[i]       
# print(f"{x} -> сумма элементов на нечётных позициях: {summ}")

# $$$$$$$$$$$$$$$$$$$$$$$$$$$$

# 2-Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# [2, 3, 4, 5, 6] => [12, 15, 16];
# [2, 3, 5, 6] => [12, 15]

# $$$$$$$$$$$$$$$$$$$$$$$$$$

# 2

# def mult_lst(lst):
#     l = len(lst)//2 + 1 if len(lst) % 2 != 0 else len(lst)//2
#     new_lst = [lst[i]*lst[len(lst)-i-1] for i in range(l)]
#     print(new_lst)

# lst = [2, 3, 4, 5, 6]
# mult_lst(lst)
# lst = list(map(int, input("Введите числа через пробел:\n").split()))
# mult_lst(lst)

# $$$$$$$$$$$$$$$$$$$$$$$$$$$$

# 3-Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.

# Пример:

# [1.1, 1.2, 3.1, 5.17, 10.02] => 0.18 или 18
# [4.07, 5.1, 8.2444, 6.98] - 0.91 или 91

# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$

# 3

# from random import uniform


# n = int(input('Введите размер списка '))
# list1 = []
# for i in range(n):
#     f = uniform(0, 9)
#     list1.append(round(f, 2))

# min = list1[0]
# max = 0
# for i in range(len(list1)):
    
#     if max < list1[i]:
#         max = list1[i]
#     if min > list1[i]:
#         min = list1[i]
# dif = (max - int(max)) - (min - int(min))

# print(list1)
# print(max, min)
# print(round(dif,2))